---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RepeatingDetailRotation
source: html/4d1b4a63-3e65-0b74-5aca-062acb298e84.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RepeatingDetailRotation Property

"Detail Rotation"

## Syntax (C#)
```csharp
public static ForgeTypeId RepeatingDetailRotation { get; }
```